["What is the nature of the roots of the quadratic equation 3x² - 5x + 2 = 0?", "Which of the following statements accurately describes the primary function of the ribosome in a eukaryotic cell?", "Which of the following is the primary function of stomata in a leaf?", "Which of the following processes is primarily responsible for the generation of 'thermal energy' in a nuclear reactor, despite the initial energy input being derived from the strong nuclear force?", "Which of the following statements accurately describes the relationship between photosynthesis and cellular respiration in terms of energy flow in an ecosystem?", "Which of the following is the primary function of the ribosomes in a eukaryotic cell?", "A particle of mass $m$ is moving in a circular path of radius $R$ with a constant speed $v$. If the total energy of the particle is $E$ and the magnitude of the angular momentum is $L$, which of the following relations is correct?", "Which of the following is the correct chemical formula for Rust?", "Which of the following is the primary function of the stomata in plant leaves?", "Which of the following is the correct chemical formula for the compound formed when aluminum reacts with chlorine?", "Which of the following is NOT a primary function of the Parliament in India?", "Which of the following is NOT a primary cause of the Greenhouse Effect?", "Which of the following is a primary greenhouse gas contributing to global warming?", "Which of the following is the most appropriate meaning of the term 'secularism' in the Indian context?", "When aqueous solutions of Silver Nitrate ($\\text{AgNO}_3$) and Sodium Chloride ($\\text{NaCl}$) are mixed, a white precipitate is formed. This reaction is an example of:", "A convex lens has a focal length of $20 \\text{ cm}$. If an object is placed at a distance of $30 \\text{ cm}$ from the lens, what will be the nature and position of the image formed?", "A series LCR circuit has an inductor ($L = 100 \\text{ mH}$), a capacitor ($C = 10 \\mu\\text{F}$), and a resistor ($R = 50 \\Omega$). If the circuit is driven by an AC voltage source with a variable frequency ($f$), at what frequency ($f_0$) will the circuit exhibit resonance, and what will be the quality factor ($Q$) of the circuit at this resonance frequency?", "A ray of light travelling in air strikes a glass slab at an angle of incidence of $30^{\\circ}$. If the refractive index of the glass slab is $\\sqrt{3}$, what will be the angle of refraction?", "When a metal X is treated with dilute hydrochloric acid, it produces hydrogen gas and a salt. The resulting solution, when treated with sodium hydroxide ($\\text{NaOH}$), forms a gelatinous white precipitate that dissolves in excess $\\text{NaOH}$. Identify the metal X and the type of reaction that occurs when X is treated with $\\text{HCl}$.", "Consider a particle moving in a one-dimensional potential given by $V(x) = -k x^2$ for $|x| < a$ and $V(x) = 0$ for $|x| \\geq a$, where $k > 0$. If the particle is in the ground state, which of the following statements about its wave function $\\psi(x)$ is correct?", "Consider a transition metal complex, $[\text{Co}(\text{en})_2(\text{NO}_2)\text{Cl}]^+$, where 'en' is ethylenediamine. Which of the following statements regarding the stereochemistry and isomerism of this complex is TRUE?", "In the context of the Indian Constitution, which directive principle of state policy (DPSP) mandates the State to organize village Panchayats and endow them with such powers and authority as may be necessary to function as units of self-government?", "Which standard open chord shape is commonly used to play the D major chord on a guitar?", "In standard tuning (E-A-D-G-B-E, low to high), which open string on a guitar produces the lowest pitch?", "एक छात्र एक प्रयोग में, $5 \\text{ cm}$ फोकस दूरी वाले अवतल लेंस (concave lens) के सामने $20 \\text{ cm}$ की दूरी पर एक मोमबत्ती रखता है। प्रतिबिंब (image) की स्थिति और प्रकृति क्या होगी?", "निम्नलिखित में से कौन सा वाक्य 'The little girl was thrilled to see the rainbow after the rain' में 'thrilled' शब्द का सबसे उपयुक्त पर्यायवाची (synonym) है?", "वाक्य 'She sells sea-shells on the sea-shore' में कौन सा साहित्यिक उपकरण (literary device) प्रमुखता से उपयोग किया गया है?"]