["A convex lens has a focal length of $20 \\text{ cm}$. If an object is placed at a distance of $30 \\text{ cm}$ from the lens, what will be the nature and position of the image formed?", "A series LCR circuit has an inductor ($L = 100 \\text{ mH}$), a capacitor ($C = 10 \\mu\\text{F}$), and a resistor ($R = 50 \\Omega$). If the circuit is driven by an AC voltage source with a variable frequency ($f$), at what frequency ($f_0$) will the circuit exhibit resonance, and what will be the quality factor ($Q$) of the circuit at this resonance frequency?", "A ray of light travelling in air strikes a glass slab at an angle of incidence of $30^{\\circ}$. If the refractive index of the glass slab is $\\sqrt{3}$, what will be the angle of refraction?", "When a metal X is treated with dilute hydrochloric acid, it produces hydrogen gas and a salt. The resulting solution, when treated with sodium hydroxide ($\\text{NaOH}$), forms a gelatinous white precipitate that dissolves in excess $\\text{NaOH}$. Identify the metal X and the type of reaction that occurs when X is treated with $\\text{HCl}$.", "Consider a particle moving in a one-dimensional potential given by $V(x) = -k x^2$ for $|x| < a$ and $V(x) = 0$ for $|x| \\geq a$, where $k > 0$. If the particle is in the ground state, which of the following statements about its wave function $\\psi(x)$ is correct?", "Consider a transition metal complex, $[\text{Co}(\text{en})_2(\text{NO}_2)\text{Cl}]^+$, where 'en' is ethylenediamine. Which of the following statements regarding the stereochemistry and isomerism of this complex is TRUE?", "In the context of the Indian Constitution, which directive principle of state policy (DPSP) mandates the State to organize village Panchayats and endow them with such powers and authority as may be necessary to function as units of self-government?", "Which standard open chord shape is commonly used to play the D major chord on a guitar?", "In standard tuning (E-A-D-G-B-E, low to high), which open string on a guitar produces the lowest pitch?", "एक छात्र एक प्रयोग में, $5 \\text{ cm}$ फोकस दूरी वाले अवतल लेंस (concave lens) के सामने $20 \\text{ cm}$ की दूरी पर एक मोमबत्ती रखता है। प्रतिबिंब (image) की स्थिति और प्रकृति क्या होगी?", "निम्नलिखित में से कौन सा वाक्य 'The little girl was thrilled to see the rainbow after the rain' में 'thrilled' शब्द का सबसे उपयुक्त पर्यायवाची (synonym) है?", "वाक्य 'She sells sea-shells on the sea-shore' में कौन सा साहित्यिक उपकरण (literary device) प्रमुखता से उपयोग किया गया है?", "What is the chemical formula for the compound formed when calcium oxide ($\\text{CaO}$) reacts completely with hydrochloric acid ($\\text{HCl}$)?", "When copper(II) sulfate (${\\text{CuSO}}_4$) is heated strongly, it loses water of crystallization and forms anhydrous copper(II) sulfate. If $25 \\text{ g}$ of ${\\text{CuSO}}_4 \\cdot 5{\\text{H}}_2{\\text{O}}$ (Molar Mass $\\approx 249.5 \\text{ g/mol}$) is completely dehydrated, approximately how many grams of anhydrous ${\\text{CuSO}}_4$ (Molar Mass $\\approx 159.5 \\text{ g/mol}$) will be left behind?", "Which of the following chemical equations correctly represents the reaction between solid sodium metal ($\text{Na}$) and water ($\text{H}_2\text{O}$) to produce sodium hydroxide ($\text{NaOH}$) and hydrogen gas ($\text{H}_2$)?", "What is the chemical formula for the compound formed when sulfuric acid ($H_2SO_4$) reacts with barium chloride ($BaCl_2$)?", "What is the chemical formula for the compound formed when the reaction between Zinc ($\text{Zn}$) and dilute Sulfuric Acid ($\text{H}_2\text{SO}_4$) occurs, and what is the nature of the gas evolved?", "A ray of light is incident on a rectangular glass slab at an angle of incidence ($i$) of $0^{\\circ}$. If the refractive index of the glass slab is $n=1.5$, what will be the angle of refraction ($r$) inside the glass slab, and what will be the angle of deviation ($\\delta$)?", "A ray of light travelling from a medium with a refractive index $\\mu_1 = 2.0$ strikes the boundary of a second medium with a refractive index $\\mu_2 = 1.5$ at an angle of incidence $i = 30^{\\circ}$. Calculate the angle of refraction ($r$) in the second medium. (Use $\\sin(48.59^{\\circ}) \\approx 0.75$)", "A $100 \\text{ cm}$ long wire of resistance $10 \\Omega$ is connected across a battery such that a current of $0.5 \\text{ A}$ flows through it. If the wire is uniformly stretched to double its original length, what will be the new resistance of the wire, assuming the volume of the wire remains constant?", "In the context of the Indian Constitution, which article deals with the 'Right to Education' as a fundamental right, making education for all children between the ages of 6 and 14 years compulsory and free?", "A concave mirror has a focal length of $15 \\text{ cm}$. An object is placed $40 \\text{ cm}$ away from the mirror. Determine the position and nature of the image formed. (Use the mirror formula: $\\frac{1}{v} + \\frac{1}{u} = \\frac{1}{f}$)", "If the chemical formula for Potassium Nitrate is $\\text{KNO}_3$, what is the chemical formula for the compound formed when Potassium Hydroxide ($\\text{KOH}$) reacts with Sulfuric Acid ($\\text{H}_2\\text{SO}_4$) in a neutralization reaction?", "In the process of digestion, which enzyme, secreted primarily by the pancreas, is responsible for breaking down complex carbohydrates (starch) into simpler sugars (like maltose) in the small intestine?", "In the context of the Indian Constitution, which fundamental right ensures that no citizen shall be discriminated against on grounds only of religion, race, caste, sex, or place of birth?", "A ray of light travelling in air ($n_1 = 1.0$) is incident on a liquid surface at an angle of incidence ($i$) of $60^{\\circ}$. If the speed of light in the liquid ($v_2$) is $2.0 \\times 10^8 \\text{ m/s}$, what is the angle of refraction ($r$) in the liquid? (Use the speed of light in vacuum, $c = 3.0 \\times 10^8 \\text{ m/s}$ and $\\sin(41.81^{\\circ}) \\approx 0.666$)", "Which of the following combinations correctly lists the primary function of the xylem and the phloem in a plant?", "In the context of Indian Civics/Political Science, which Amendment Act to the Constitution of India introduced the Goods and Services Tax (GST), fundamentally altering the indirect tax structure of the country?", "In the context of biology, which organelle in a plant cell is primarily responsible for the synthesis of fatty acids and phospholipids, and also plays a crucial role in detoxification processes?", "A student sets up an experiment using a concave mirror. If the object distance ($u$) is $-50 \\text{ cm}$ and the focal length ($f$) is $-20 \\text{ cm}$, what is the image distance ($v$) and the magnification ($m$)?", "A student is observing the reflection of light using a plane mirror. If the distance between the object and the mirror is $10 \\text{ cm}$, and the student moves $2 \\text{ cm}$ closer to the mirror, what will be the new distance between the object and its image?", "Balance the following redox reaction in an acidic medium:\n$$\\text{Cr}_2\\text{O}_7^{2-} + \\text{C}_2\\text{O}_4^{2-} \\rightarrow \\text{Cr}^{3+} + \\text{CO}_2$$\nWhat are the stoichiometric coefficients for $\\text{Cr}_2\\text{O}_7^{2-}$, $\\text{C}_2\\text{O}_4^{2-}$, and $\\text{CO}_2$ respectively, in the balanced equation?", "Balance the following chemical equation representing the reaction between potassium permanganate ($\text{KMnO}_4$) and hydrogen peroxide ($\text{H}_2\text{O}_2$) in an acidic medium ($\text{H}_2\text{SO}_4$) to produce potassium sulfate ($\text{K}_2\text{SO}_4$), manganese sulfate ($\text{MnSO}_4$), oxygen gas ($\text{O}_2$), and water ($\text{H}_2\text{O}$):\n$$\\text{KMnO}_4 + \\text{H}_2\\text{O}_2 + \\text{H}_2\\text{SO}_4 \\rightarrow \\text{K}_2\\text{SO}_4 + \\text{MnSO}_4 + \\text{O}_2 + \\text{H}_2\\text{O}$$\nWhat are the stoichiometric coefficients for $\\text{KMnO}_4$, $\\text{H}_2\\text{O}_2$, and $\\text{O}_2$ in the balanced equation, respectively?", "Which of the following is the SI unit for electric current?", "In the context of computer science and basic programming logic, which of the following operators is used for the logical 'AND' operation?", "ভারতের সংবিধানের কোন অনুচ্ছেদে ৬ থেকে ১৪ বছর বয়সী সকল শিশুর জন্য শিক্ষাকে বাধ্যতামূলক ও বিনামূল্যে করার অধিকারকে মৌলিক অধিকার হিসাবে অন্তর্ভুক্ত করা হয়েছে?", "পৃথিবীর বায়ুমণ্ডলে গ্রিনহাউস প্রভাবের জন্য প্রধানত দায়ী গ্যাস কোনটি?", "ভারতের সংবিধানের কোন অনুচ্ছেদে ৬ থেকে ১৪ বছর বয়স্ক শিশুর জন্য শিক্ষাকে বাধ্যতামূলক ও বিনামূল্যে করার অধিকারকে মৌলিক অধিকার হিসাবে অন্তরভুক্ত করা হয়েছে? (অশ্মান্তিক ক্ষেত্রত্বেদের সংখ্যা আর্না হয়েছে)", "A rectangular block of glass has dimensions $10 \\text{ cm} \\times 5 \\text{ cm} \\times 3 \\text{ cm}$ (Length $\\times$ Width $\\times$ Height). If the refractive index of the glass is $n=1.5$, and a ray of light enters the block perpendicular to the $10 \\text{ cm} \\times 5 \\text{ cm}$ face, what is the time taken for the light ray to travel from the entry face to the opposite face through the block, assuming the speed of light in a vacuum is $c = 3.0 \\times 10^8 \\text{ m/s}$?", "ব্যাকরণের দিক থেকে, 'The sun rises in the east.' - এই বাক্যটিতে 'rises' শব্দটি কোন প্রকারের ক্রিয়া (verb) হিসেবে ব্যবহৃত হয়েছে?"]