["A particle moves along the x-axis with an initial velocity of 10 m/s and a constant acceleration of -2 m/s².  At what time(s) will the particle be 12 meters away from its starting point?", "A projectile is launched from the ground with an initial velocity of 20 m/s at an angle of 30° above the horizontal.  Ignoring air resistance, what is the approximate horizontal distance the projectile travels before hitting the ground? (Take g = 10 m/s²)", "A car starts from rest and accelerates uniformly at 2 m/s² for 10 seconds. It then maintains a constant velocity for 5 seconds before decelerating uniformly to rest in 5 seconds. What is the total distance covered by the car?", "A ball is thrown vertically upward from the ground with an initial velocity of 20 m/s.  Another ball is dropped from a height of 40m at the same instant. At what height above the ground will the two balls meet? (Assume g = 10 m/s²)", "Choose the word that is closest in meaning to 'gregarious':", "Choose the word that is most similar in meaning to 'Diligent':", "Choose the word that is the opposite in meaning to 'Happy':", "Choose the word that best completes the sentence: The sun was ______ behind the clouds.", "Choose the word that is closest in meaning to 'Enormous':", "Choose the word that is closest in meaning to 'Diligent':", "A particle is projected from the ground with an initial velocity of 25 m/s at an angle of 60° with the horizontal.  At what time(t) will its velocity vector make an angle of 45° with the horizontal during its upward motion? (Take g = 10 m/s²)", "एक कण एक वृत्ताकार पथ पर गतिमान है जिसका त्रिज्या R है। यदि कण का वेग v है और इसका त्वरण a है, तो कण के द्वारा केंद्र की ओर लगने वाले अभिकेंद्र बल के कारण उत्पन्न अभिकेंद्रीय त्वरण का मान क्या होगा?", "একটি কণা স্থিরবেগে  v = 2i + 3j m/s  বেগে চলছে।  t = 2 সেকেন্ড পর কণাটির সরণ কত হবে?", "एक कण एकसमान त्वरण a = 2 m/s² से गतिमान है।  यदि t = 0 पर इसका वेग u = 10 m/s है, तो t = 5 s पर कण का विस्थापन कितना होगा?", "A particle is moving along a straight line with an initial velocity of 5 m/s and a constant acceleration of 2 m/s².  At what distance from its starting point will its velocity be 15 m/s?", "एक कण एकसमान त्वरण 2 m/s² से गतिमान है। यदि इसका प्रारंभिक वेग 5 m/s है और 10 सेकंड बाद इसका वेग 25 m/s हो जाता है, तो इस समय अंतराल में कण द्वारा तय की गई दूरी क्या होगी?", "A particle starts from rest and moves with a constant acceleration of 4 m/s².  After traveling for 5 seconds, the acceleration changes to -2 m/s². How far will the particle travel in the next 3 seconds?", "Which of the following is NOT a characteristic of a democracy?", "Which of the following statements best describes the relationship between photosynthesis and cellular respiration?", "A company's net profit margin is calculated by dividing net profit by:", "A 2 kg block is placed on a frictionless inclined plane making an angle of 30° with the horizontal.  What is the magnitude of the acceleration of the block down the plane? (Assume g = 10 m/s²)", "A simple pendulum of length L is oscillating with a small amplitude.  If the length of the pendulum is doubled, what happens to the period of oscillation?", "When an aqueous solution of Barium Chloride is mixed with an aqueous solution of Sodium Sulphate, a white precipitate of Barium Sulphate is formed. Which type of chemical reaction does this represent?", "Which of the following substances, when dissolved in water, would turn red litmus paper blue?"]